; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l3-t1-p4---int100n150-m25---int100c110---s12---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 - location
t0 - truck
p0 p1 p2 p3 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 - fuellevel
)

(:init
(sum level0 level20 level20)
(sum level0 level23 level23)
(sum level0 level24 level24)
(sum level1 level20 level21)
(sum level1 level23 level24)
(sum level1 level24 level25)
(sum level2 level20 level22)
(sum level2 level23 level25)
(sum level2 level24 level26)
(sum level3 level20 level23)
(sum level3 level23 level26)
(sum level3 level24 level27)
(sum level4 level20 level24)
(sum level4 level23 level27)
(sum level4 level24 level28)
(sum level5 level20 level25)
(sum level5 level23 level28)
(sum level5 level24 level29)
(sum level6 level20 level26)
(sum level6 level23 level29)
(sum level6 level24 level30)
(sum level7 level20 level27)
(sum level7 level23 level30)
(sum level7 level24 level31)
(sum level8 level20 level28)
(sum level8 level23 level31)
(sum level8 level24 level32)
(sum level9 level20 level29)
(sum level9 level23 level32)
(sum level9 level24 level33)
(sum level10 level20 level30)
(sum level10 level23 level33)
(sum level10 level24 level34)
(sum level11 level20 level31)
(sum level11 level23 level34)
(sum level11 level24 level35)
(sum level12 level20 level32)
(sum level12 level23 level35)
(sum level12 level24 level36)
(sum level13 level20 level33)
(sum level13 level23 level36)
(sum level13 level24 level37)
(sum level14 level20 level34)
(sum level14 level23 level37)
(sum level14 level24 level38)
(sum level15 level20 level35)
(sum level15 level23 level38)
(sum level15 level24 level39)
(sum level16 level20 level36)
(sum level16 level23 level39)
(sum level16 level24 level40)
(sum level17 level20 level37)
(sum level17 level23 level40)
(sum level17 level24 level41)
(sum level18 level20 level38)
(sum level18 level23 level41)
(sum level18 level24 level42)
(sum level19 level20 level39)
(sum level19 level23 level42)
(sum level19 level24 level43)
(sum level20 level20 level40)
(sum level20 level23 level43)
(sum level20 level24 level44)
(sum level21 level20 level41)
(sum level21 level23 level44)
(sum level21 level24 level45)
(sum level22 level20 level42)
(sum level22 level23 level45)
(sum level22 level24 level46)
(sum level23 level20 level43)
(sum level23 level23 level46)
(sum level23 level24 level47)
(sum level24 level20 level44)
(sum level24 level23 level47)
(sum level24 level24 level48)
(sum level25 level20 level45)
(sum level25 level23 level48)
(sum level25 level24 level49)
(sum level26 level20 level46)
(sum level26 level23 level49)
(sum level26 level24 level50)
(sum level27 level20 level47)
(sum level27 level23 level50)
(sum level27 level24 level51)
(sum level28 level20 level48)
(sum level28 level23 level51)
(sum level28 level24 level52)
(sum level29 level20 level49)
(sum level29 level23 level52)
(sum level30 level20 level50)
(sum level31 level20 level51)
(sum level32 level20 level52)

(connected l0 l1)
(fuelcost level20 l0 l1)
(connected l0 l2)
(fuelcost level23 l0 l2)
(connected l1 l0)
(fuelcost level20 l1 l0)
(connected l1 l2)
(fuelcost level24 l1 l2)
(connected l2 l0)
(fuelcost level23 l2 l0)
(connected l2 l1)
(fuelcost level24 l2 l1)

(at t0 l1)
(fuel t0 level52)
(= (total-cost) 0)

(at p0 l2)
(at p1 l1)
(at p2 l1)
(at p3 l1)
)

(:goal
(and
(at p0 l1)
(at p1 l2)
(at p2 l2)
(at p3 l2)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p3 t0 l1)
   deleted: (at p3 l1)
   added: (in p3 t0)
   goals met: 0 of 4
2. (load p2 t0 l1)
   deleted: (at p2 l1)
   added: (in p2 t0)
   goals met: 0 of 4
3. (load p1 t0 l1)
   deleted: (at p1 l1)
   added: (in p1 t0)
   goals met: 0 of 4
4. (drive t0 l1 l2 level28 level24 level52)
   deleted: (at t0 l1) (fuel t0 level52)
   added: (at t0 l2) (fuel t0 level28)
   goals met: 0 of 4
5. (unload p1 t0 l2)
   deleted: (in p1 t0)
   added: (at p1 l2)
   goals met: 1 of 4
6. (load p0 t0 l2)
   deleted: (at p0 l2)
   added: (in p0 t0)
   goals met: 1 of 4
7. (unload p2 t0 l2)
   deleted: (in p2 t0)
   added: (at p2 l2)
   goals met: 2 of 4
8. (unload p3 t0 l2)
   deleted: (in p3 t0)
   added: (at p3 l2)
   goals met: 3 of 4
9. (drive t0 l2 l1 level4 level24 level28)
   deleted: (at t0 l2) (fuel t0 level28)
   added: (at t0 l1) (fuel t0 level4)
   goals met: 3 of 4
10. (unload p0 t0 l1)
   deleted: (in p0 t0)
   added: (at p0 l1)
   goals met: 4 of 4
